Revit 2027 API
ExtrusionRoof.GetProfile Method
Retrieve the Profile of ExtrusionRoof.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ModelCurveArray GetProfile()
Public Function GetProfile As ModelCurveArray
public:
ModelCurveArray^ GetProfile()
member GetProfile : unit -> ModelCurveArray
Return Value
ModelCurveArray
See Also
Reference
ExtrusionRoof Class
Autodesk.Revit.DB Namespace